[
  {
    "name": "Rose",
    "watering": "2 inches of water a week.",
    "sowing": "The rose seed must first go through a period of cold moist storage. Once the process has been completed, a hole approximately ¼ of an inch must be created in a planting tray, and the seed placed inside. The trays used should not exceed 3-4 inches deep. The planting mix used should be very moist, but not soaked. Each tray that was used must be sealed in a plastic bag and placed in a refrigerator from 10 to 12 weeks.",
    "planting": "Once the seeds have be in the refrigerator for the 10 to 12 weeks, they must then be placed in a warm environment, about to 70 F. The rose seeds will begin to sprout over the course of two to three weeks in this new environment. At this point in time, only 20 to 30 percent of the seeds planted will actually have sprouted." +
    "The rose seeds that have sprouted should then be transferred into their own pots. When completing this step, it strictly advised not to touch the roots. An excellent tool that can help avoid this disaster, is using a spoon for transferring." +
    "It is also a good idea to begin feeding the seeds a half strength fertilizer and allow them to have plenty of sunlight. To increase the health of the seeds, fungicide should be used. By using a fungicide, this allows the seeds to become less vulnerable to diseases. Another tip in preventing disease and pests is to provide the seeds with light as possible and good air circulation." +
    "If disease does show up on one of them, it is best to remove it an keep the hardiest of the seedlings."
    "It is best to keep in mind not to over water the seeds, for it can end in failure and cause the seeds to die. When it is time for the seedlings to actually flower, it may take a very long while."
    "care": "When watering your roses, it is best to make sure that they get about 2 inches a week. If you have a large bed of roses, or roses and companions, it is advised to use a soaker hose or install an in-ground system." +
    "When feeding your roses, it should be done before and throughout the blooming cycle while using a recommend fertilizer. Using an all-purpose garden fertilizer is a great option. Fertilizers targeted for roses, such as Rose Food, are good options but not mandatory for a healthy rose. In spring, you can water your roses with about a tablespoon of Epson salt dissolved in a gallon of water to promote strong canes." +
    "It is recommend to groom your roses as much as you can. If you see dead wood you can remove dead canes down to the ground level using sharp clippers. Remove stems that are rubbing together (choose one and spare the other)." +
    "If you notice that the plant begins getting spent flowers that are brown, it is best to get rid of them. Deadheading promotes the plant to make new beautiful flowers.",
    "harvest_and_storage": "Harvest roses just after they bloom. Roses harvest best just after they bloom. Wait until the flowers have fully unfolded to harvest your roses. The best time to harvest is in Spring or Summer." +
    "When harvesting, you cut a rose's stem twice. Use a quality hand pruner or garden scissors to make the first cut low on the stem. Make one quick cut, leaving a little more stem than you want. You'll be making a second cut later, so leave the stem an inch longer than you want. Once you have cut the stem, place the roses in water immediately.",
    "companion_plants": "Garlic, Geraniums, Parsley, and Tomatoes. "
  },
  {
    "name": "Shasta Daisies",
    "watering": "1 to 2 inches of water per week during the summer. During spring and fall, daisies benefit from about 1 to 2 inches of water applied every other week.",
    "sowing": "Seeds of Shasta daisy are sown in early winter through late spring, and can also be sown in fall.",
    "planting": "The best time to plant Shasta Daisies is a time fall and early spring. Average sandy soil can be used for daises, however overly dry conditions will cause the plant to wilt and eventually die out. It is recommend to plant daises where they can get a lot of light allowing them to grow the best that they can, they can tolerate areas in the shade but it will cause minimal flowering." +
    "Shasta daisy prefers regular moisture but does not like overly wet feet. It can tolerate limited periods of drought in the garden.",
    "care": "It will beneficial to deadhead the plant as soon as the bloom fades, allowing there to be a second even third blooming. Deadheading the plant should be done regularly, and you should not wait for the plant to completely finish blooming. Stems should be cutdown just below the foliage when deadheading.
    "Pests such as Aphids can visit the developing buds in early spring, but don’t tend to do much damage.",
    "harvest_and_storage": "It is best to begin deadheading the daises towards the end of the season, around September or October. Prompting the plant to stop producing flowers and begin producing more seeds. The seed head is located in the middle of the petals. It’s important to allow the seed head to completely ripen before picking it from the plant. Cut the stem at the base of the plant and enclose the seed head end in a paper bag, secured with string. Hang the paper bag upside down in a dry area to dry completely, and shake the stem so the capsule releases the seeds within the bag.",
    "companion_plants": "Shasta daisies grow well with other tall, summer blooming perennials such as coneflowers, rudbeckia, bee balm and Joe-Pye weed."
  },

  {
    "name": "Tulip",
    "watering:": "Indoor plants usually require once or twice weekly watering, while outdoor pots may need watering as often as once daily.",
    "sowing": "Sow Crack open the dried seed pod and empty the seeds. Place the seeds in a plastic bag with a small amount of moistened peat moss. Place the bag in the refrigerator at a temperature of 40F for 90 days to simulate winter weather condition. Remove the seeds from cold storage after 90 days. Discard any moldy seeds." +
    "Fill the bottom of a cold frame with a loamy potting soil mixed with one-third part sand. Sow the seeds on top of the soil, and barely cover them with a dusting of soil. Water the seeds with about an inch of water per week to keep them moist." +
    "Leave the tulips in the cold frame for up to 18 months from the time they are sown. The seeds will grow into seedlings about six to eight weeks after sowing. Plant the seedlings outdoors the following fall in a well-draining composted soil.",
    "planting": "Plant your tulip bulbs in the fall from September to December, or they send their leaves up in time to get frozen by winter. Don’t plant too early. You should plant the bulb in groups of ten if you’re putting it in your perennial border, and space them a couple of inches apart, and it is a good idea to plant in area where they will receive a lot of sunlight since they do not do well in the shade." +
    "You need to dig each hole three times as deep as the tulip bulb is tall. There should be twice as much soil over the tip of the bulb as height of the bulb, so if your tulip bulb measures 2 ½ inches tall, dig your hole 8 inches deep, so you’ll have 5 inches of soil above the bulb. Set the bulb so the pointy end is facing up. Don’t worry if you get some upside down. They should flower anyhow, but it will take them longer to come through the ground in spring and they may not be as tall as they should. After the tulips bulbs are planted, you need to water them thoroughly and then cover the area with a mulch of pine bark or shredded leaves to protect them.",
    "care": " Water when planted, but don’t water again until foliage appears. Bulbs don’t like wet feet." +
    "Gray mold, slugs, snails, aphids, and bulb rot. Squirrels, rabbits, mice, and voles are frequent pests to tulip bulbs, but can be deterred by placing holly or other thorny leaves in with the bulbs."  +
    "Fertilize them in the fall when they are planted and establishing their roots and again when growth appears. Don’t fertilize after flowers have bloomed." +
    "Deadhead tulip flowers after the petals have dropped. After flowering, the plant will continue to grow and store nutrients for next year, so leave the foliage intact until it has completely died back.",
    "harvest_and_storage": "Any soil, old leaves or roots should be gently removed from the bulbs. Separate any new bulbs that have formed. Make sure the bulbs are totally dry before storing or they will rot. Provide good air circulation, warm temperatures, and darkness until you are ready to replant. Many gardeners use trays or mesh bags for tulip storage.",
    "companion_plants": "Daylily, Catnip, Bells of Ireland and Salvia."
  },
  {
    "name": "Morning Glory",
    "watering": "Check the soil every two to three days to ensure the top 1 inch is moist.",
    "sowing": " You can start seed indoors, 4 - 6 weeks before your last frost date, but it's not necessary. They do very well when direct sown. What until the soil is able to be worked and the soil has warmed to at least 60 F. " +
    "Morning glory seeds are very hard and germination will be faster with scarification. You can do this by rubbing them between 2 pieces of coarse sandpaper for a few seconds and then soak them overnight. You will notice they are a lot plumper in the morning and look ready to sprout" +
    "Sow them about 1/4 inch deep, spaced a few inches apart. If you are planting a row of morning glories, 6-inch spacing will be fine. If you are planting a trellis, you don't need to be too particular about spacing. Don't forget to water the seeds in well and keep the soil moist until they sprout.",
    "planting": "Select a planting site that has full sun and moist, well-drained soil. Work organic compost or well-aged animal manure into the ground prior to planting to help retain moisture and prevent plants from wilting during the heat of the day. " +
    "Morning glory is easy to grow from seed. Plant outdoors 1/2 inch deep after the last frost and keep moist while germinating. Seeds will germinate in 5-21 days. Seeds can be nicked and soaked in water for 24 hours before planting for better results. Thin seedlings to 4-6 inches apart. Provide support so the young plants can climb." +
    "If you have trouble getting morning glory started, make sure the planting site is in full sun and that the seedlings never dry out until they become established. Provide an organic bloom fertilizer two or three times during the gardening season.",
    "care": "Morning glories are very low maintenance. It is not required to deadhead." +
    "Morning glory flowers are only open when in direct sunlight, however when there is shade, the flowers will close. So it should not be expected to see “morning” glories during the afternoon if they are in the shade."+
    "Morning glory vines seldom are seldom bothered by insects or diseases, although in wet weather they can contract several fungal problems, like leaf spot, stem rot, thread blight and white blister. " +
    "bigger problem is 4-footed animals who love to munch on the leaves. Deer, rabbits, and groundhogs can do a lot of damage to the lower vines, especially while they are young. You can prevent this by fencing around the lower 3 - 5 ft. The vines will eventually grow through the fencing and disguise it. At that point, if animals do a little browsing, it shouldn't kill the whole plant. You could also spray them with a deterrent.",
    "harvest_and_storage": "Look through the morning glory vines to find dead flowers that are ready to drop off. The blooms will leave a small, round pod behind at the end of the stem. Once these pods are hard and brown, crack one open. If you find a number of small black seeds, your seeds of morning glories are ready for harvest. Snap off the stems below the seed pods and collect all the pods in a paper bag. Bring them into the house and crack them open over a paper towel-covered plate. The seeds are small and black, but large enough to spot easily." +
    "Place the plate in a warm, dark spot where it won’t be disturbed to allow the seeds to continue drying. After one week, try to pierce a seed with a thumbnail. If the seed is too hard to puncture, they have dried enough." +
    "Pour the dried seeds into a bag, squeeze out as much air as possible and store the bag until next spring. The desiccant will absorb any stray moisture that may be remaining in the seeds, allowing them to stay dry throughout the winter without danger of mold. You may also pour 2 tbsp of dried milk powder onto the center of a paper towel, folding it over to create a packet. The dried milk powder will absorb any stray moisture.",
    "companion_plants": "Melon.",
  {
    "name": "Corn",
    "sowing": "Corn favors direct sunlight, especially when direct sowing. It needs to be planted in well drained soil, which dramatically increases your yield. Good soil preparation is very important. " +
    "You can prepare your soil by making sure it has a lot of organic matter and fertlizer. It is also a good idea to wait for the temperature of the soil to reach 60 F or 18 C. " +
    "Another way to make sure your soil is ready for direct sowing is making sure you wait a few days after a frost, otherwise, your crop will sparse. ",
    "planting": "It is important to make sure your rows are 24 - 30 inches apart from each other. The seed needs to be planted 1 - 2 inches deep into the soil with 9 - 12 inches apart from one another. Mulch will help keep your corn weed-free and even help retain moisture during dry weather. " +
    "Planting corn can be interesting because there are so many varities and they vary in time needed to mature. You can plant 60, 70, or 90-day corn or you can opt for a continuous growing season by planting several types of corn at different time intervals so you have a continous stream of corn. ",
    "care": "Corn needs a lot of moisture. It needs at least 1 inch of water every seven days until it is roughly 15 inches tall and at least 1 inch of water every five days until tassels form. Tassels are the male flower of the corn plant that appear on top of the plant once the bulk of the growing is completed. " +
    "It is important to note that tassels can be green, purple, or yellow. The purpose of a tassel is to produce pollen for the crop which helps with growth and ripening. ",
    "harvest_and_storage": "Corn is ready to harvest approximately 20 days after the silk first appears. When the crop is ready to harvest, the silk turns brown, while the husks remain green. Every stalk should have at least one ear near the top. There may even be another ear lower down the stalk. The lower ears usually take a little logner to mature and tend to be a little smaller than the ear at the top. " +
    "It is crucial that you make sure your crop is in the "milk stage" before harvesting. Milk stage - A milky liquid is inside a kernel (you puncture one to check). If the liquid is clear then the kernels are not ready. However, if there is no liquid at all then you waited too long to harvest your crop. " +
    "Corn is best when harvested early in the morning. Grasp the top ear firmly and pull down, then twist and pull. It usually comes off fairly easily. It is good practice to harvest only what you will eat. However, it is important that you harvest entire crop while it is in the milky stage so that you do not lose out on the harvest. " +
    "Storing your crop is important to preserve its freshness since the sugars begin converting into starches in about a week or so which will make the corn taste more like what you would buy at the grocery store rather than garden fresh corn." +
    "A method that is widely practiced is storing fresh picked corn in the refrigerator, where is stays fresh for up to a week. Freezing the crop is a good option if you wish to store it for longer periods. You can freeze it on the cob or simply cut it off the cob. Cutting it off the cob merely helps save space. ",
    "companion_plant": "Corn is part of a trio of crops called, "Three Sisters". The, "three sisters" consists of corn, squash, and beans. It is important to note that the Three Sisters consist corn, winter squash, and mature dry beans, not summer squash or green beans. This is an age old planting technique that was even used by the Native Americans. " +
    "Corn also grows well alongside cucumbers, lettuce, melons, peas, potatoes, and sunflowers."
  }
  {
    "name": "Tomato",
    "sowing": "Tomatoes like warm weather and generally will not grow when temperatures are under 50 F or 10 C so be sure that the soil is 60 F or 16 C. If you want to sow tomato seeds indoors, plant the seeds in seed starting trays about 6 weeks before the last frost date. Be sure to use a sterile seed starting mix, when sowing. This helps rduce damping off in the seeds. Growing them in a bright and sunny window is best. Ideally, the temperatures would not be below 65 F or 18 C. " +
    "It is best if the plant is in well-draining soil, in direct sunlight, plenty of organic matter, fertilizer and moisture. ",
    "planting": "Root the tomato suckers. Tomato suckers are tiny branchlets that grow between the stem and branches. Simply snip off a 4 inch long sucker. Place the sucker in a jar filled with water and leave it in a sunny spot. You should see roots in about 9 days. Once the roots appear large enough, simply plant them. It will need some shade for a few days so that it can adjust but after that it is just like any other tomato plant. " +
    "You could also plant the stem so deep that it is inserted right up to the first set of leaves so that the suckers that will grow are already planted. The plants should be about 3 feet apart when planting with cages. " +
    "When planting with stakes then 2 feet between plants is good enough. And you can insert the stake when you plant the seedlings. 5 feet between rows is a good rule of thumb. ",
    "care": "The plant itself should either be caged or staked so that the stem is sturdy. And once the plant becomes sturdy enough, you should stake them again for additional support. Staking tomatoes also makes harvesting easier, as the fruits are more accessible since they are not on the ground. " +
    "Mulching tomato plants help them retain moisture. This is important because tomatoes require a lot of water, thus moisture is a key component in the success of a tomato plants harvest. ",
    "harvest_and_storage": "Tomatoes emite ethylene gas which is produced by fully formed mature green tomatoes. This crop can be picked before it is fully ripened. The end of a tomatos growing season is usually late summer. " +
    "Grasping the tomato firmly but gently, then pulling from the plant by holding the stem with one hand and the fruit with the other will allow you to harvest the tomato without harming the tomato plant or brusing the tomato. " +
    "Storing the fruit indoors will still allow the tomato to continue to ripen. Green tomatoes will actually ripen faster if wrapped in newsprint as the ethylene gas will be contained. " +
    "A temperature of 55 - 70 F or 13 - 21 C is ideal. Storing the tomatoes at a cooler temperature is also acceptable and is beneficial when you want to slow the ripening process. Just be sure to keep checking daily to see if your tomato has fully matured. ",
    "companion_plant": "Tomatoes can be grown alongside a fairly wide array of other plants such as vegetables, herbs and flowers. Vegetables include chives, onions, and garlic. Peppers (both sweet and hot) are especially great companion plants. Spinach, lettuce, arugula, carrots, and asparagus are good too. " +
    "Herbs include parsley, mint, and basil. Flowers include marigolds and nasturtiums."
  }
  {
    "name": "Chives",
    "sowing": "Chives typically prefer temperatures of 60 - 70 F or 15 - 21 C. Be sure to direct sow them once all danger of frost has passed. The soil should be moist and high in organic matter with a soil pH of 6 - 8. " +
    "planting": "The space between plants should be 4 - 15 inches apart with the rows being 20 or more inches apart. The soil should contain 4 - 6 inches of composted organic matter with 2 - 3 tablespoons of all purpose fertilizer per square foot of planting area. " +
    "6 - 8 inches of soil should be enough to plant the seeds/bulbs and have the compost and fertilizer. The plant should also be put in direct sunlight or partial shade. ",
    "care": "It is good to fertilize the plants a few times during the growing season with bone meal and manure. ",
    "harvest_and_storage": "It is very easy to harvest this herb. Once the chievs are about a foot tall simply cut off what you need. Cutting the plant back to half its size will not harm the plant. " +
    "You can even consume the flowers that may start to grow on the plant. It is not necessary to store chives as you can harvest what you need when you need it without the danger of mising the harvest. The whole process of growing and harvesting chives is very simple. ",
    "companion_plant": "Roses are a great plant to grow alongside chives as there is a mutual benefit relationship between the two. Growing chives near apple trees is also beneficial, moreso for the apple tree than the chives though. Grapes are an excellent companion plant. Chives are a great companion plant for carrots, celery, lettuce, peas and even tomatoes."
  }
  {
    "name": "Cucumber",
    "sowing": "Starting cucumbers can be fairly easy. They can be started indoors in peat pots or small flats and transplanted to the garden a couple weeks later. All danger of frost must have passed for the year before transplatning them outside. " +
    "They like humid weather, loose and organic soil, and lots of sunlight. The soil should be free of rocks, sticks an debris of the like. Adding compost when planting them will help get the cucumbers off to a good start. ",
    "planting": "Be sure to plant them at least 1 inch deep. Since cucumbers are vined crops, you can train them to climb a fence as their vines grow. The alternative is to plant them in rows while risking the vines to overlap with each other although is does not affect the growth of the plant. ",
    "care": "Cucumbers thrive in temperatures between 65 - 75 F or 18 - 23 C. Exposure to temperatures below 55 F or 13 C can be detrimental to the growth or even the survival of the plant. " +
    "It is a good strategy to grow the crop in a sheltered area of your garden so that they are protected from random cold snaps. Covering the cucumbers will help protect them from cold snaps as well. You can cover them with bed sheets, plstic, and even newspaper. " +
    "harvest_and_storage": "They tend to be ready 50 - 70 days after planting. Harvesting them at the right time ensures they are sweet and not bitter at all. If they are left on the vine for too long then they will have a bit of a bitter taste to them. " +
    "It is important to note that each cucumber ripens at different times even if they are on the same vine! They also must be picked before they start to show any signs of yellowing, which indicates they have matured and are now past their prime. " +
    "Cucumbers do not continue to ripen after they are harvested. Ripe cucumbers have a firm, green flesh. The size depends on the variety. At the peak of the season, harvesting will take place every 1 - 2 days between each other. " +
    "You can store them for up to three days in the crisper. You must put them in loose plastic or perforated bags. Try not to stack them as that will lead to bruising and will decrease the overall firmness of the cucumber. ",
    "companion_plant": "Broccoli, Cabbage, Cauliflower, Corn, Lettuce, Peas, Beans, Radishes, Onions and Sunflowers."
  }
  {
    "name": "Egg plant",
    "sowing": "Egg plants germiante at temperatures between 60 - 95 F or 15 - 35 C with seedlings emerging in about 7 - 10 days. " +
    "The seeds will even remain viable for about 4 years. They are typically started indoors unless you live in an extemely warm, humid region. ",
    "planting": "Planting a seed should be done indoors or in a greenhouse setting in order to protect the seedlings from frost. If you plant them too early you risk harming the egg plant. The soil needs to be warm before being put outdoors. " +
    "If they are planted too early then the cold soil will kill the roots. They even tend to be more sensitive to the cold than tomatoes. " +
    "They should be about 18 inches apart in the row that needs to be roughly 30 inches apart from each other. ",
    "care": "Frequently water your egg plants during the summer. They thrive on the summer heat, but need constant moisture to prevent them from drying out. To help retain moisture, make sure that the soil is moist as well. " +
    "It is good to side-dress your plants with nitrogen so that you get the best results you can when your crop fully matures. ".
    "harvest_and_storage": "You can pick an egg plant when it is 6 - 8 inches long. Be sure to use a knife to cut the egg plant from the stem as twisting it off the stem could harm the plant. " +
    "Harvesting an egg plant as soon as it matures is crucial because if you let the fruit get old it becomes spongy, bitter and just not as tasty. The younger ones tend to have the best flavor. ",
    "companion_plant": "Peppers, Tomatoes, Potatoes, Spinach, Beans and Peas."
  }
  }

]